huygithcm/code_tung/esp32_car/src/main.cpp
// Ket thuc don (da ve HOME): dung, san sang don ke tiep.
void finishRoute() {
  stopMotors(); lineFollow = false;
  running = false; stepPhase = 0;
  routeTarget = ""; cargo = true;
  hubLog("[route] xong -> ve HOME, san sang");
  sendTelemetry();
}

// Nap chuoi buoc tu hub va bat dau. Re-anchor odometry tai HOME.
void startRoute(JsonArrayConst steps, const char* target) {
  routeN = 0;
  for (JsonVariantConst v : steps) if (routeN < 48) route[routeN++] = String(v.as<const char*>());
  routeIdx = 0; stepPhase = 0; leftStart = false;
  routeTarget = target ? target : "";
  cargo = true;
  resetOdometry();            // xe dang o HOME -> xoa troi tich luy
  running = true;
  hubLog("[route] bat dau -> " + routeTarget + " (" + String(routeN) + " buoc)");
}

// Chay 1 nhip cua route (goi trong loop khi running).
// Moi buoc F/L/R/B = RE truoc (0/+90/-90/180) roi TIEN 1 canh toi giao diem/het line.
void routeStep() {
  if (routeIdx >= routeN) { finishRoute(); return; }
  String s = route[routeIdx];

  if (s == "DROP") { doDrop(); routeIdx++; return; }
  if (s == "HOME") { routeIdx++; return; }   // buoc cuoi -> finishRoute o nhip sau

  if (stepPhase == 0) {                       // --- Pha 0: re dau doan ---
    float deg = 0;
    if      (s == "L") deg = 90;
    else if (s == "R") deg = -90;
    else if (s == "B") deg = 180;
    if (deg != 0) turnRelative(deg);          // rE tai cho (PID, blocking)
    segStartX = poseX; segStartY = poseY; leftStart = false;
    lastError = 0; errIntegral = 0;
    stepPhase = 1;
    return;
  }

  // --- Pha 2: bo thang them de canh TRUC BANH vao tam nga tu roi moi re ---
  if (stepPhase == 2) {
    float d = (pulsesToMM(encL) + pulsesToMM(encR)) * 0.5f - centerStartMM;
    if (d < CENTER_OFFSET_MM) { driveA(baseSpeed); driveB(baseSpeed); }   // bo thang
    else { stopMotors(); stepPhase = 0; routeIdx++; }                     // da canh tam -> buoc ke
    return;
  }

  // --- Pha 1: tien bam line den giao diem ke (hoac het line = tam o) ---
  lineFollowStep();
  float trav = hypotf(poseX - segStartX, poseY - segStartY);
  if (!leftStart && lineCount <= 2 && !lineLost) leftStart = true;   // da roi nga tu cu
  bool reached = false;
  if (trav > MIN_EDGE) {
    if (leftStart && (lineCount >= INTERSECT_N || lineLost)) reached = true;  // toi nga tu / het line
    if (trav > MAX_EDGE) reached = true;                                       // an toan
  }
  if (reached) {                       // thay nga tu -> chuyen sang bo canh tam (khong re ngay = tranh re som)
    centerStartMM = (pulsesToMM(encL) + pulsesToMM(encR)) * 0.5f;
    stepPhase = 2;
  }
}

// ===================== Hieu chuan quang duong =====================
// Chay thang bam line tu giao diem hien tai -> giao diem ke (biet knownMM, mac dinh 475).
// Do quang duong odometry (trung binh 2 banh) roi goi y WHEEL_DIAMETER da hieu chuan.
void calibDistance(float knownMM) {
  running = false; lineFollow = false;
  resetOdometry();
  leftStart = false;
  hubLog("[caldist] Chay thang toi giao diem ke (biet " + String(knownMM, 0) + "mm)...");

  unsigned long t0 = millis();
  auto travel = []() { return (fabs(pulsesToMM(encL)) + fabs(pulsesToMM(encR))) * 0.5f; };  // mm trung binh 2 banh
  while (millis() - t0 < 8000) {                 // timeout 8s
    updateOdometry();
    lineFollowStep();                            // bam line 1 nhip
    float trav = travel();
    if (!leftStart && lineCount <= 2 && !lineLost) leftStart = true;   // da roi giao diem xuat phat
    if (trav > MIN_EDGE) {
      if (leftStart && (lineCount >= INTERSECT_N || lineLost)) break;  // toi giao diem ke
      if (trav > MAX_EDGE) break;                                      // an toan
    }
    delay(5);
  }
  stopMotors();

  float measured = travel();
  float suggest  = (measured > 1) ? WHEEL_DIAMETER_MM * knownMM / measured : WHEEL_DIAMETER_MM;
  char buf[176];
  snprintf(buf, sizeof(buf),
    "[caldist] biet=%.0fmm do=%.1fmm (encL=%ld encR=%ld) | WHEEL_DIAMETER hien=%.2f -> goi y=%.2fmm",
    knownMM, measured, encL, encR, WHEEL_DIAMETER_MM, suggest);
  hubLog(buf);
}

// Su kien WebSocket toi hub.
void onWsEvent(WStype_t type, uint8_t* payload, size_t len) {
  switch (type) {
    case WStype_CONNECTED:
      hubOK = true;
      wsClient.sendTXT("{\"role\":\"car\"}");
      Serial.println("[ws] Da ket noi hub, khai bao role=car");
      break;
    case WStype_DISCONNECTED:
      hubOK = false;
      Serial.println("[ws] Mat ket noi hub");
      break;
    case WStype_TEXT: {
      JsonDocument doc;
      if (deserializeJson(doc, payload, len)) return;   // loi parse -> bo
      const char* cmd = doc["cmd"];
      if (!cmd) return;                                 // hello/khac -> bo qua
      if      (!strcmp(cmd, "route"))  startRoute(doc["steps"].as<JsonArrayConst>(), doc["target"] | "");
      else if (!strcmp(cmd, "stop"))   { running = false; lineFollow = false; stopMotors(); routeTarget = ""; hubLog("[ws] STOP"); }
      else if (!strcmp(cmd, "manual")) doManual(String((const char*)(doc["dir"] | "S")));
      else if (!strcmp(cmd, "drop"))   doDrop();
      else if (!strcmp(cmd, "calib"))  { hubLog("[calib] Bat dau hieu chuan line..."); calibrateLine(); }
      else if (!strcmp(cmd, "tune")) {                  // chinh tham so runtime tu web
        if (!doc["base"].isNull())     baseSpeed     = constrain((int)doc["base"], 0, 255);
        if (!doc["min"].isNull())      MOTOR_MIN_PWM = constrain((int)doc["min"], 0, 255);
        if (!doc["kp"].isNull())       Kp = (float)doc["kp"];
        if (!doc["kd"].isNull())       Kd = (float)doc["kd"];
        if (!doc["turnmin"].isNull())  TURN_MIN = constrain((int)doc["turnmin"], 0, 255);
        if (!doc["turnmax"].isNull())  TURN_MAX = constrain((int)doc["turnmax"], 0, 255);
        if (!doc["speed"].isNull())    motorSpeed = constrain((int)doc["speed"], 0, 255);
        if (!doc["kpt"].isNull())      KpT = (float)doc["kpt"];
        if (!doc["kdt"].isNull())      KdT = (float)doc["kdt"];
        if (!doc["turntol"].isNull())  TURN_TOL_DEG = (float)doc["turntol"];
        if (!doc["wheeld"].isNull())   WHEEL_DIAMETER_MM = (float)doc["wheeld"];
        if (!doc["ppr"].isNull())      ENCODER_PPR = (int)doc["ppr"];
        if (!doc["wbase"].isNull())    WHEEL_BASE_MM = (float)doc["wbase"];
        if (!doc["center"].isNull())   CENTER_OFFSET_MM = constrain((int)doc["center"], 0, 300);
        if (!doc["gyrow"].isNull())    GYRO_W = constrain((float)doc["gyrow"], 0.0f, 1.0f);
        if (!doc["gyrosign"].isNull()) GYRO_SIGN = ((int)doc["gyrosign"] >= 0) ? 1 : -1;
        hubLog("[tune] base=" + String(baseSpeed) + " min=" + String(MOTOR_MIN_PWM) +
               " kp=" + String(Kp, 1) + " kd=" + String(Kd, 1) +
               " turnmin=" + String(TURN_MIN) + " turnmax=" + String(TURN_MAX) +
               " kpt=" + String(KpT, 1) + " kdt=" + String(KdT, 1) +
               " tol=" + String(TURN_TOL_DEG, 1) + " speed=" + String(motorSpeed) +
               " wheeld=" + String(WHEEL_DIAMETER_MM, 2) + " ppr=" + String(ENCODER_PPR) +
               " wbase=" + String(WHEEL_BASE_MM, 1) + " center=" + String(CENTER_OFFSET_MM) +
               " gyro=" + String(mpuOK ? "OK" : "--") + " gyrow=" + String(GYRO_W, 2) +
               " gyrosign=" + String(GYRO_SIGN));
      }
      else if (!strcmp(cmd, "turn")) {                  // test 1 cu re (deg): +trai / -phai
        float deg = doc["deg"] | 90.0;
        hubLog("[turn] test re " + String(deg, 0) + " do...");
        turnRelative(deg);
      }
      else if (!strcmp(cmd, "enc")) {                   // doc encoder (hieu chuan chieu dem)
        if (!doc["reset"].isNull()) resetOdometry();
        hubLog("[enc] L=" + String(encL) + " R=" + String(encR) +
               " x=" + String(poseX, 0) + " y=" + String(poseY, 0) +
               " th=" + String(poseTheta * 180.0f / PI, 1) +
               " | gyro=" + String(mpuOK ? "OK" : "--") +
               (mpuOK ? (" wz=" + String((mpuGyroZraw() - gyroBiasZ) / GYRO_LSB_PER_DPS, 1) + "do/s") : ""));
      }
      else if (!strcmp(cmd, "caldist")) {               // hieu chuan quang duong (1 canh line)
        calibDistance(doc["known"] | 475.0);
      }
      else if (!strcmp(cmd, "gyrocal")) {               // do lai troi tinh gyro (xe phai dung yen)
        stopMotors();
        hubLog("[gyro] Do troi tinh - GIU XE DUNG YEN...");
        gyroCalibrate();
      }
      else if (!strcmp(cmd, "i2cscan")) i2cScan();      // quet bus I2C (tim MPU6050)
      else if (!strcmp(cmd, "line"))    reportLine();   // doc 8 mat line
      break;
    }
    default: break;
  }
}

